/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   server_bonus.c                                     :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: marvin <marvin@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2024/12/15 01:00:09 by marvin            #+#    #+#             */
/*   Updated: 2024/12/15 01:00:09 by marvin           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minitalk.h"

void a(int signal, siginfo_t *info, void *context)
{
	
}
int main(void)
{
	
}
sigactionの設定について詳しく教えて。sigactionについてもそもそもあまりわかっていません。
